virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/uart.h
/* -------- UART_SR : (UART Offset: 0x14) ( R/ 32) Status Register -------- */
#define UART_SR_RXRDY_Pos                     _U_(0)                                               /**< (UART_SR) Receiver Ready Position */
#define UART_SR_RXRDY_Msk                     (_U_(0x1) << UART_SR_RXRDY_Pos)                      /**< (UART_SR) Receiver Ready Mask */
#define UART_SR_RXRDY(value)                  (UART_SR_RXRDY_Msk & ((value) << UART_SR_RXRDY_Pos))
#define UART_SR_TXRDY_Pos                     _U_(1)                                               /**< (UART_SR) Transmitter Ready Position */
#define UART_SR_TXRDY_Msk                     (_U_(0x1) << UART_SR_TXRDY_Pos)                      /**< (UART_SR) Transmitter Ready Mask */
#define UART_SR_TXRDY(value)                  (UART_SR_TXRDY_Msk & ((value) << UART_SR_TXRDY_Pos))
#define UART_SR_OVRE_Pos                      _U_(5)                                               /**< (UART_SR) Overrun Error Position */
#define UART_SR_OVRE_Msk                      (_U_(0x1) << UART_SR_OVRE_Pos)                       /**< (UART_SR) Overrun Error Mask */
#define UART_SR_OVRE(value)                   (UART_SR_OVRE_Msk & ((value) << UART_SR_OVRE_Pos))  
#define UART_SR_FRAME_Pos                     _U_(6)                                               /**< (UART_SR) Framing Error Position */
#define UART_SR_FRAME_Msk                     (_U_(0x1) << UART_SR_FRAME_Pos)                      /**< (UART_SR) Framing Error Mask */
#define UART_SR_FRAME(value)                  (UART_SR_FRAME_Msk & ((value) << UART_SR_FRAME_Pos))
#define UART_SR_PARE_Pos                      _U_(7)                                               /**< (UART_SR) Parity Error Position */
#define UART_SR_PARE_Msk                      (_U_(0x1) << UART_SR_PARE_Pos)                       /**< (UART_SR) Parity Error Mask */
#define UART_SR_PARE(value)                   (UART_SR_PARE_Msk & ((value) << UART_SR_PARE_Pos))  
#define UART_SR_TIMEOUT_Pos                   _U_(8)                                               /**< (UART_SR) Receiver Time-out Position */
#define UART_SR_TIMEOUT_Msk                   (_U_(0x1) << UART_SR_TIMEOUT_Pos)                    /**< (UART_SR) Receiver Time-out Mask */
#define UART_SR_TIMEOUT(value)                (UART_SR_TIMEOUT_Msk & ((value) << UART_SR_TIMEOUT_Pos))
#define UART_SR_TXEMPTY_Pos                   _U_(9)                                               /**< (UART_SR) Transmitter Empty Position */
#define UART_SR_TXEMPTY_Msk                   (_U_(0x1) << UART_SR_TXEMPTY_Pos)                    /**< (UART_SR) Transmitter Empty Mask */
#define UART_SR_TXEMPTY(value)                (UART_SR_TXEMPTY_Msk & ((value) << UART_SR_TXEMPTY_Pos))
#define UART_SR_CMP_Pos                       _U_(15)                                              /**< (UART_SR) Comparison Match Position */
#define UART_SR_CMP_Msk                       (_U_(0x1) << UART_SR_CMP_Pos)                        /**< (UART_SR) Comparison Match Mask */
#define UART_SR_CMP(value)                    (UART_SR_CMP_Msk & ((value) << UART_SR_CMP_Pos))    
#define UART_SR_SWES_Pos                      _U_(21)                                              /**< (UART_SR) SleepWalking Enable Status Position */
#define UART_SR_SWES_Msk                      (_U_(0x1) << UART_SR_SWES_Pos)                       /**< (UART_SR) SleepWalking Enable Status Mask */
#define UART_SR_SWES(value)                   (UART_SR_SWES_Msk & ((value) << UART_SR_SWES_Pos))  
#define UART_SR_CLKREQ_Pos                    _U_(22)                                              /**< (UART_SR) Clock Request Position */
#define UART_SR_CLKREQ_Msk                    (_U_(0x1) << UART_SR_CLKREQ_Pos)                     /**< (UART_SR) Clock Request Mask */
#define UART_SR_CLKREQ(value)                 (UART_SR_CLKREQ_Msk & ((value) << UART_SR_CLKREQ_Pos))
#define UART_SR_WKUPREQ_Pos                   _U_(23)                                              /**< (UART_SR) Wake-Up Request Position */
#define UART_SR_WKUPREQ_Msk                   (_U_(0x1) << UART_SR_WKUPREQ_Pos)                    /**< (UART_SR) Wake-Up Request Mask */
#define UART_SR_WKUPREQ(value)                (UART_SR_WKUPREQ_Msk & ((value) << UART_SR_WKUPREQ_Pos))
#define UART_SR_Msk                           _U_(0x00E083E3)                                      /**< (UART_SR) Register Mask  */


/* -------- UART_RHR : (UART Offset: 0x18) ( R/ 32) Receive Holding Register -------- */
#define UART_RHR_RXCHR_Pos                    _U_(0)                                               /**< (UART_RHR) Received Character Position */
#define UART_RHR_RXCHR_Msk                    (_U_(0xFF) << UART_RHR_RXCHR_Pos)                    /**< (UART_RHR) Received Character Mask */
#define UART_RHR_RXCHR(value)                 (UART_RHR_RXCHR_Msk & ((value) << UART_RHR_RXCHR_Pos))
#define UART_RHR_Msk                          _U_(0x000000FF)                                      /**< (UART_RHR) Register Mask  */


/* -------- UART_THR : (UART Offset: 0x1C) ( /W 32) Transmit Holding Register -------- */
#define UART_THR_TXCHR_Pos                    _U_(0)                                               /**< (UART_THR) Character to be Transmitted Position */
#define UART_THR_TXCHR_Msk                    (_U_(0xFF) << UART_THR_TXCHR_Pos)                    /**< (UART_THR) Character to be Transmitted Mask */
#define UART_THR_TXCHR(value)                 (UART_THR_TXCHR_Msk & ((value) << UART_THR_TXCHR_Pos))
#define UART_THR_Msk                          _U_(0x000000FF)                                      /**< (UART_THR) Register Mask  */


/* -------- UART_BRGR : (UART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */
#define UART_BRGR_CD_Pos                      _U_(0)                                               /**< (UART_BRGR) Clock Divisor Position */
#define UART_BRGR_CD_Msk                      (_U_(0xFFFF) << UART_BRGR_CD_Pos)                    /**< (UART_BRGR) Clock Divisor Mask */
#define UART_BRGR_CD(value)                   (UART_BRGR_CD_Msk & ((value) << UART_BRGR_CD_Pos))  
#define UART_BRGR_Msk                         _U_(0x0000FFFF)                                      /**< (UART_BRGR) Register Mask  */


/* -------- UART_CMPR : (UART Offset: 0x24) (R/W 32) Comparison Register -------- */
#define UART_CMPR_VAL1_Pos                    _U_(0)                                               /**< (UART_CMPR) First Comparison Value for Received Character Position */
#define UART_CMPR_VAL1_Msk                    (_U_(0xFF) << UART_CMPR_VAL1_Pos)                    /**< (UART_CMPR) First Comparison Value for Received Character Mask */
#define UART_CMPR_VAL1(value)                 (UART_CMPR_VAL1_Msk & ((value) << UART_CMPR_VAL1_Pos))
#define UART_CMPR_CMPMODE_Pos                 _U_(12)                                              /**< (UART_CMPR) Comparison Mode Position */
#define UART_CMPR_CMPMODE_Msk                 (_U_(0x1) << UART_CMPR_CMPMODE_Pos)                  /**< (UART_CMPR) Comparison Mode Mask */
#define UART_CMPR_CMPMODE(value)              (UART_CMPR_CMPMODE_Msk & ((value) << UART_CMPR_CMPMODE_Pos))
#define   UART_CMPR_CMPMODE_FLAG_ONLY_Val     _U_(0x0)                                             /**< (UART_CMPR) Any character is received and comparison function drives CMP flag.  */
#define   UART_CMPR_CMPMODE_START_CONDITION_Val _U_(0x1)                                             /**< (UART_CMPR) Comparison condition must be met to start reception.  */
#define UART_CMPR_CMPMODE_FLAG_ONLY           (UART_CMPR_CMPMODE_FLAG_ONLY_Val << UART_CMPR_CMPMODE_Pos) /**< (UART_CMPR) Any character is received and comparison function drives CMP flag. Position  */
#define UART_CMPR_CMPMODE_START_CONDITION     (UART_CMPR_CMPMODE_START_CONDITION_Val << UART_CMPR_CMPMODE_Pos) /**< (UART_CMPR) Comparison condition must be met to start reception. Position  */
#define UART_CMPR_CMPPAR_Pos                  _U_(14)                                              /**< (UART_CMPR) Compare Parity Position */
#define UART_CMPR_CMPPAR_Msk                  (_U_(0x1) << UART_CMPR_CMPPAR_Pos)                   /**< (UART_CMPR) Compare Parity Mask */
#define UART_CMPR_CMPPAR(value)               (UART_CMPR_CMPPAR_Msk & ((value) << UART_CMPR_CMPPAR_Pos))
#define UART_CMPR_VAL2_Pos                    _U_(16)                                              /**< (UART_CMPR) Second Comparison Value for Received Character Position */
#define UART_CMPR_VAL2_Msk                    (_U_(0xFF) << UART_CMPR_VAL2_Pos)                    /**< (UART_CMPR) Second Comparison Value for Received Character Mask */
#define UART_CMPR_VAL2(value)                 (UART_CMPR_VAL2_Msk & ((value) << UART_CMPR_VAL2_Pos))
#define UART_CMPR_Msk                         _U_(0x00FF50FF)                                      /**< (UART_CMPR) Register Mask  */


/* -------- UART_RTOR : (UART Offset: 0x28) (R/W 32) Receiver Time-out Register -------- */
#define UART_RTOR_TO_Pos                      _U_(0)                                               /**< (UART_RTOR) Time-out Value Position */
#define UART_RTOR_TO_Msk                      (_U_(0xFF) << UART_RTOR_TO_Pos)                      /**< (UART_RTOR) Time-out Value Mask */
#define UART_RTOR_TO(value)                   (UART_RTOR_TO_Msk & ((value) << UART_RTOR_TO_Pos))  
#define UART_RTOR_Msk                         _U_(0x000000FF)                                      /**< (UART_RTOR) Register Mask  */


